In [1]:
import pandas as pd
import numpy as np

Pandas Documentation
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html

In [2]:
data = pd.DataFrame({"Order_No": ["Ord1","Ord1","Ord2","Ord2","Ord2","Ord3","Ord3","Ord3","Ord4"], 
    "Product_Name": ["Apple","Banana","Grape","Apple","Mango","Banana","Grape","Apple","Cherries"],
    "Product_Quantly": [1,10,4,6,5,4,5,6,7],
    "Price_per_Piece" : [10,2,20,10,45,2,20,10,100]})
data

  Order_No Product_Name  Product_Quantly  Price_per_Piece
0     Ord1        Apple                1               10
1     Ord1       Banana               10                2
2     Ord2        Grape                4               20
3     Ord2        Apple                6               10
4     Ord2        Mango                5               45
5     Ord3       Banana                4                2
6     Ord3        Grape                5               20
7     Ord3        Apple                6               10
8     Ord4     Cherries                7              100

In [5]:
#Display a summary of the basic information about this DataFrame and its data 
data.shape

(9, 4)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Order_No         9 non-null      object
 1   Product_Name     9 non-null      object
 2   Product_Quantly  9 non-null      int64
 3   Price_per_Piece  9 non-null      int64
dtypes: int64(2), object(2)
memory usage: 416.0+ bytes

In [7]:
data.describe()

       Product_Quantly  Price_per_Piece
count         9.000000         9.000000
mean          5.333333        24.333333
std           2.449490        31.232995
min           1.000000         2.000000
25%           4.000000        10.000000
50%           5.000000        10.000000
75%           6.000000        20.000000
max          10.000000       100.000000

In [12]:
data.head()

  Order_No Product_Name  Product_Quantly  Price_per_Piece
0     Ord1        Apple                1               10
1     Ord1       Banana               10                2
2     Ord2        Grape                4               20
3     Ord2        Apple                6               10
4     Ord2        Mango                5               45

# Indexing

In [14]:
data.iloc[2]

Order_No            Ord2
Product_Name       Grape
Product_Quantly        4
Price_per_Piece       20
Name: 2, dtype: object

In [20]:
data.iloc[[2,4],[1,2]]

  Product_Name  Product_Quantly
2        Grape                4
4        Mango                5

In [26]:
data.iloc[[2,4],[True,False,True,False]]

  Order_No  Product_Quantly
2     Ord2                4
4     Ord2                5

# Set Index

In [22]:
data_index = data.set_index("Order_No")
data_index

         Product_Name  Product_Quantly  Price_per_Piece
Order_No
Ord1            Apple                1               10
Ord1           Banana               10                2
Ord2            Grape                4               20
Ord2            Apple                6               10
Ord2            Mango                5               45
Ord3           Banana                4                2
Ord3            Grape                5               20
Ord3            Apple                6               10
Ord4         Cherries                7              100

In [23]:
data_index.iloc[1]

Product_Name       Banana
Product_Quantly        10
Price_per_Piece         2
Name: Ord1, dtype: object

In [24]:
q = 10

In [25]:
data_index.loc["Ord1"]

         Product_Name  Product_Quantly  Price_per_Piece
Order_No
Ord1            Apple                1               10
Ord1           Banana               10                2

In [27]:
data_index.loc[["Ord1","Ord2"]]

         Product_Name  Product_Quantly  Price_per_Piece
Order_No
Ord1            Apple                1               10
Ord1           Banana               10                2
Ord2            Grape                4               20
Ord2            Apple                6               10
Ord2            Mango                5               45

In [36]:
data_index.loc['Ord1'] = 10

In [37]:
data_index

         Product_Name  Product_Quantly  Price_per_Piece
Order_No
Ord1               10               10               10
Ord1               10               10               10
Ord2            Grape               10               20
Ord2            Apple               10               10
Ord2            Mango               10               45
Ord3           Banana                4                2
Ord3            Grape                5               20
Ord3            Apple                6               10
Ord4         Cherries                7              100

In [40]:
data_index.loc['Ord2',"Product_Quantly"] = 100

In [41]:
data_index

         Product_Name  Product_Quantly  Price_per_Piece
Order_No
Ord1               10               10               10
Ord1               10               10               10
Ord2            Grape              100               20
Ord2            Apple              100               10
Ord2            Mango              100               45
Ord3           Banana                4                2
Ord3            Grape                5               20
Ord3            Apple                6               10
Ord4         Cherries                7              100

## Selecting Data

In [42]:
data.Order_No == "Ord1"

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
Name: Order_No, dtype: bool

In [43]:
data[data.Order_No == "Ord1"]

  Order_No Product_Name  Product_Quantly  Price_per_Piece
0     Ord1        Apple                1               10
1     Ord1       Banana               10                2

## Creating New Fields

In [44]:
data['Price'] = data['Product_Quantly']*data['Price_per_Piece']

In [45]:
data

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price
0     Ord1        Apple                1               10     10
1     Ord1       Banana               10                2     20
2     Ord2        Grape                4               20     80
3     Ord2        Apple                6               10     60
4     Ord2        Mango                5               45    225
5     Ord3       Banana                4                2      8
6     Ord3        Grape                5               20    100
7     Ord3        Apple                6               10     60
8     Ord4     Cherries                7              100    700

## Grouping

In [46]:
data.groupby(['Order_No']).sum()

          Product_Quantly  Price_per_Piece  Price
Order_No
Ord1                   11               12     30
Ord2                   15               75    365
Ord3                   15               32    168
Ord4                    7              100    700

In [47]:
data.groupby(['Order_No']).min()

         Product_Name  Product_Quantly  Price_per_Piece  Price
Order_No
Ord1            Apple                1                2     10
Ord2            Apple                4               10     60
Ord3            Apple                4                2      8
Ord4         Cherries                7              100    700

In [48]:
data.groupby(['Order_No'])['Price'].sum()

Order_No
Ord1     30
Ord2    365
Ord3    168
Ord4    700
Name: Price, dtype: int64

In [49]:
data.groupby(['Order_No']).agg({"Product_Quantly": ["count","min"],
                               "Price": ['sum']})

         Product_Quantly     Price
                   count min   sum
Order_No
Ord1                   2   1    30
Ord2                   3   4   365
Ord3                   3   4   168
Ord4                   1   7   700

## Questions 

### 1 - Write code to get quantity of each fruit sold 
### 2 - Total Sales 
### 3 - Total Orders

## Merging

In [50]:
customer_info = pd.DataFrame({"Order_No" : ["Ord1","Ord2","Ord3","Ord5"],
                              "Customer_Name" : ["John","Rob","Bob","Mike"]})
customer_info

  Order_No Customer_Name
0     Ord1          John
1     Ord2           Rob
2     Ord3           Bob
3     Ord5          Mike

In [ ]:
data

# How much John purchased?

In [51]:
data_merge_inner = data.merge(customer_info,  on = ['Order_No'], how = "inner")
data_merge_inner

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price Customer_Name
0     Ord1        Apple                1               10     10          John
1     Ord1       Banana               10                2     20          John
2     Ord2        Grape                4               20     80           Rob
3     Ord2        Apple                6               10     60           Rob
4     Ord2        Mango                5               45    225           Rob
5     Ord3       Banana                4                2      8           Bob
6     Ord3        Grape                5               20    100           Bob
7     Ord3        Apple                6               10     60           Bob

In [52]:
data_merge_left = data.merge(customer_info,  on = ['Order_No'], how = "left")
data_merge_left

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price Customer_Name
0     Ord1        Apple                1               10     10          John
1     Ord1       Banana               10                2     20          John
2     Ord2        Grape                4               20     80           Rob
3     Ord2        Apple                6               10     60           Rob
4     Ord2        Mango                5               45    225           Rob
5     Ord3       Banana                4                2      8           Bob
6     Ord3        Grape                5               20    100           Bob
7     Ord3        Apple                6               10     60           Bob
8     Ord4     Cherries                7              100    700           NaN

In [53]:
data_merge_right = data.merge(customer_info,  on = ['Order_No'], how = "right")
data_merge_right

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price Customer_Name
0     Ord1        Apple              1.0             10.0   10.0          John
1     Ord1       Banana             10.0              2.0   20.0          John
2     Ord2        Grape              4.0             20.0   80.0           Rob
3     Ord2        Apple              6.0             10.0   60.0           Rob
4     Ord2        Mango              5.0             45.0  225.0           Rob
5     Ord3       Banana              4.0              2.0    8.0           Bob
6     Ord3        Grape              5.0             20.0  100.0           Bob
7     Ord3        Apple              6.0             10.0   60.0           Bob
8     Ord5          NaN              NaN              NaN    NaN          Mike

In [54]:
data_merge_outer = data.merge(customer_info,  on = ['Order_No'], how = "outer")
data_merge_outer

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price Customer_Name
0     Ord1        Apple              1.0             10.0   10.0          John
1     Ord1       Banana             10.0              2.0   20.0          John
2     Ord2        Grape              4.0             20.0   80.0           Rob
3     Ord2        Apple              6.0             10.0   60.0           Rob
4     Ord2        Mango              5.0             45.0  225.0           Rob
5     Ord3       Banana              4.0              2.0    8.0           Bob
6     Ord3        Grape              5.0             20.0  100.0           Bob
7     Ord3        Apple              6.0             10.0   60.0           Bob
8     Ord4     Cherries              7.0            100.0  700.0           NaN
9     Ord5          NaN              NaN              NaN    NaN          Mike

## Questions 
### 1 -> No. of orders in which customer information is missing

In [55]:
df1 = pd.DataFrame({"Name":["Shubham","Kapil"],
                   "Gender": ["M","M"]})
df1

      Name Gender
0  Shubham      M
1    Kapil      M

In [58]:
df2 = pd.DataFrame({"Name":["Dev","Shikha","Shubham"],
                   "Gender": ["M","F","M"]})
df2

      Name Gender
0      Dev      M
1   Shikha      F
2  Shubham      M

In [59]:
df3 = pd.DataFrame({"Course":["ML","DS"]})
df3

  Course
0     ML
1     DS

In [60]:
pd.concat([df2,df3], axis=1)

      Name Gender Course
0      Dev      M     ML
1   Shikha      F     DS
2  Shubham      M    NaN

In [61]:
df2 = pd.DataFrame({"Name":["Dev","Shikha","Shubham"],
                   "Gender1": ["M","F","M"],
                   "Account": [1000,2000,3000]})
df2

      Name Gender1  Account
0      Dev       M     1000
1   Shikha       F     2000
2  Shubham       M     3000

In [62]:
pd.concat([df1,df2], axis=0)

      Name Gender Gender1  Account
0  Shubham      M     NaN      NaN
1    Kapil      M     NaN      NaN
0      Dev    NaN       M   1000.0
1   Shikha    NaN       F   2000.0
2  Shubham    NaN       M   3000.0

In [ ]:
data

In [63]:
data.pivot_table(index = "Order_No", columns = "Product_Name", values = "Price_per_Piece", aggfunc = "sum")

Product_Name  Apple  Banana  Cherries  Grape  Mango
Order_No
Ord1           10.0     2.0       NaN    NaN    NaN
Ord2           10.0     NaN       NaN   20.0   45.0
Ord3           10.0     2.0       NaN   20.0    NaN
Ord4            NaN     NaN     100.0    NaN    NaN

In [ ]:
data

In [64]:
data.iloc[4]

Order_No            Ord2
Product_Name       Mango
Product_Quantly        5
Price_per_Piece       45
Price                225
Name: 4, dtype: object

In [65]:
data_index = data.set_index(['Order_No'])
data_index

         Product_Name  Product_Quantly  Price_per_Piece  Price
Order_No
Ord1            Apple                1               10     10
Ord1           Banana               10                2     20
Ord2            Grape                4               20     80
Ord2            Apple                6               10     60
Ord2            Mango                5               45    225
Ord3           Banana                4                2      8
Ord3            Grape                5               20    100
Ord3            Apple                6               10     60
Ord4         Cherries                7              100    700

In [66]:
data_index.loc[["Ord3","Ord1"]]

         Product_Name  Product_Quantly  Price_per_Piece  Price
Order_No
Ord3           Banana                4                2      8
Ord3            Grape                5               20    100
Ord3            Apple                6               10     60
Ord1            Apple                1               10     10
Ord1           Banana               10                2     20

In [67]:
data[(data.Order_No == "Ord1") & (data.Product_Name == "Apple") ]

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price
0     Ord1        Apple                1               10     10

In [68]:
data[(data.Order_No.isin(["Ord1","Ord2"])) & (data.Product_Name == "Apple") ]

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price
0     Ord1        Apple                1               10     10
3     Ord2        Apple                6               10     60